docs/1c-export-2026-06-02/Documents/УстановкаАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаАкций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкционнаяЦена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/УстановкаАкций/Ext/ObjectModule.bsl
перем мПроведен; 

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Движения.ЦеныНоменклатуры.Очистить();
	Движения.ЦеныНоменклатуры.мКонтрольАкций = ложь;
	Движения.ЦеныНоменклатуры.мПериод = ДатаНачала;
	Движения.ЦеныНоменклатуры.ДополнительныеСвойства.Вставить("УстановкаАкций", Ссылка);
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		//Если ТекСтрокаТовары.АкционнаяЦена = ТекСтрокаТовары.Цена Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		ЕдиницаИзмерения =  Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("кг",,, ТекСтрокаТовары.Номенклатура); 
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = ДатаНачала;
		Движение.ТипЦен = ТипЦен;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Валюта = ТекСтрокаТовары.Валюта;
		Движение.Цена = ТекСтрокаТовары.АкционнаяЦена;
		Движение.ЕдиницаИзмерения = ЕдиницаИзмерения; 


		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = КонецДня(ДатаОкончания);
		Движение.ТипЦен = ТипЦен;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Валюта = ТекСтрокаТовары.Валюта;
		//Движение.Цена = ТекСтрокаТовары.Цена;
		Движение.Цена = 0;

		Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;

	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если Не мПроведен = Ссылка.Проведен Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Регистратор
		|ИЗ
		|	Документ.УстановкаАкций.Товары КАК УстановкаАкцийТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО УстановкаАкцийТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И УстановкаАкцийТовары.Ссылка.ДатаНачала < ЦеныНоменклатуры.Период
		|			И УстановкаАкцийТовары.Ссылка.ДатаОкончания > ЦеныНоменклатуры.Период
		|ГДЕ
		|	УстановкаАкцийТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.Регистратор";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Выборка.Регистратор.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	мПроведен = Проведен;
КонецПроцедуры

// Производит перезаполнение и установку необходимых полей в строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части, которую необходимо перезаполнить.
//
Процедура ПерезаполнитьСтроку(СтрокаТабличнойЧасти) Экспорт 

	Если Не ЗначениеЗаполнено(ТипЦен) Тогда // ничего делать не надо.
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦен", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ТипыЦен", Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыЦенСправочник.Ссылка КАК ТипЦен,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Цена ЕСТЬ NULL
	               |				И ЦеныНоменклатурыСХарактеристикой.Цена ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Цена, ЦеныНоменклатурыБезХарактеристики.Цена)
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Валюта ЕСТЬ NULL
	               |				И ЦеныНоменклатурыСХарактеристикой.Валюта ЕСТЬ NULL
	               |			ТОГДА ТипыЦенСправочник.ВалютаЦены
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Валюта, ЦеныНоменклатурыБезХарактеристики.Валюта)
	               |	КОНЕЦ КАК Валюта
	               |ИЗ
	               |	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенСправочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыБезХарактеристики
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыБезХарактеристики.ТипЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЦеныНоменклатурыСХарактеристикой
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыСХарактеристикой.ТипЦен
	               |ГДЕ
	               |	ТипыЦенСправочник.Ссылка В(&ТипыЦен)";

	Выборка = Запрос.Выполнить().Выбрать();


	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти.Цена 			= Выборка.Цена;
		СтрокаТабличнойЧасти.АкционнаяЦена 	= Выборка.Цена;
		СтрокаТабличнойЧасти.Валюта 		= Выборка.Валюта;
		
	КонецЦикла;

КонецПроцедуры
